import { Product } from './Product.js'
import { Category } from './Category.js'

const TepliKostumy1 = new Product({
   title: 'Теплі костюми',
   href: 'TepliKostumy1',
   title_long: 'Теплий стильний костюм для чоловіків від LION STYLE 🦁',
   breaf: 'Розмір: 48-58',
   material: 'софтшел на флісі (Туреччина)👍',
   description: [
      'Колір: чорний',
      'Дуже зручний, теплий і стильний костюм для амбітних і спортивних чоловіків. Костюм виготовлений з високоякісної турецької тканини, софтшел на флісі, вологостійкий і водонепроникний.',
      'Можна носити в будь-яку погоду, сніг, град, дощ, злива, до -12 градусів морозу.',
      'Добре захищає та зігріває в будь-яку непогоду.',
      'Зручні великі накладні кишені на брюках і на куртці.',
      'Стильні бокові кишені на куртці з яскравими металевими блискавками.',
      'Великий зручний капюшон, який захистить в будь-яку непогоду.',
      'Центральна металева срібляна блискавка та хромовані елементи, що довершують вишуканий сучасний стиль активного ділового і спортивного чоловіка.',
      'В костюмі від LION STYLE завжди відчуваєш себе комфортно і впевнено в будь-якій ситуації! Він ідеально підходить як молодим активним і амбітним людям, так і дорослим солідним чоловікам!👌',
   ],
   price: 3999,
   fake_price: 4850,
   imgs: ['/img/IMG_20231018_134523.jpg', '/img/IMG_20231018_134602.jpg', '/img/IMG_20231018_134630.jpg', '/img/IMG_20231018_134724.jpg', '/img/IMG_20231018_134801.jpg', '/img/IMG_20231018_134835.jpg', '/img/IMG_20231018_135333.jpg']
})







const FlisovyKostyumZeleniBlyskavky = new Product({
   title: 'Флісовий костюм з зеленими блискавками.',
   href: 'FlisovyKostyumZeleniBlyskavky',
   title_long: 'Стильний теплий чорний костюм з яскравими зеленими блискавками від LION STYLE 🦁',
   breaf: 'Розмір: 48-58 (будь-який під замовлення)',
   material: 'флісова тканина (Туреччина), фурнітура (Німеччина)',
   description: [
      'Колір: чорний (зелені блискавки)',
      'Флісова кофта класичного спортивного стилю з водонепроникною яскравою зеленою блискавкою по всій довжині. Подвійний шар флісу попереду для додаткового тепла. Бокові кишені з водонепроникними яскравими блискавками. Ворот класичною високою стійкою. Манжети на рукавах. Регулюючий шнурок зі стопорами понизу. 👌',
      'Брюки класичного спортивного стилю зі зручними боковими кишенями з яскравими зеленими водонепроникними блискавками, з манжетами понизу та регулюючим пояс шнурком. 👌',
      'У нашому неповторному флісовому костюмі від LION STYLE ви будете почувати себе комфортно, зручно і впевнено у будь-якій ситуації, при будь-якій погоді та в будь-якому місці! Він ідеально підходить як для занять спортом, активного відпочинку, так і повсякденного використання! Він пасує як молодим, так і дорослим чоловікам! Костюми від LION STYLE це ваш неповторний, унікальний, вишуканий стиль, який одразу помічають всі! 👍',
      'Замовляйте саме зараз по акційній ціні: 1999 грн. 🔥',
   ],
   price: 1999,
   fake_price: 2850,
   imgs: ['/img/IMG_20240217_181745.jpg', '/img/IMG_20240217_181758.jpg', '/img/IMG_20240217_181831.jpg', '/img/IMG_20240217_181903.jpg', '/img/IMG_20240217_181927.jpg', '/img/IMG_20240217_181946.jpg', '/img/IMG_20240217_182014.jpg', '/img/IMG_20240217_182032.jpg', '/img/IMG_20240217_182216.jpg', '/img/IMG_20240217_182312.jpg', '/img/IMG_20240217_182340.jpg', '/img/IMG_20240217_182402.jpg', '/img/IMG_20240217_182642.jpg', '/img/IMG_20240217_182712.jpg', '/img/IMG_20240217_182935.jpg']
})

const Kurtka = new Product({
   title: 'Тепла куртка',
   href: 'Kurtka',
   title_long: 'Тепла стильна куртка для чоловіків від LION STYLE 🦁',
   breaf: 'Розмір: 48-56',
   material: 'софтшел на флісі (Туреччина)👍',
   description: [
      'Колір: чорний',
      'Стильна ексклюзивна куртка для амбітних і спортивних людей.',
      'Дуже тепла, виготовлена з високоякісної турецької тканини, софтшел на флісі, вологостійка і водонепроникна.',
      'Можна носити в будь-яку погоду, сніг, град, дощ, злива, до -12 градусів морозу. Добре захищає та зігріває в будь-яку непогоду.',
      'Дві зручні накладні кишені, дві великих бокових кишені з яскравими металевими блискавками.',
      'Великий зручний капюшон, який захистить в будь-яку непогоду.',
      'Центральна металева срібляна блискавка та хромовані елементи, що довершують вишуканий сучасний стиль активного ділового чоловіка.',
      'В куртці від LION STYLE відчуваєш себе комфортно і впевнено, в ній завжди тепло і зручно!👌',
      'Ідеально підходить, як дорослим солідним чоловікам, так і молодим амбітним хлопцям! 👍',
   ],
   price: 2450,
   fake_price: 3950,
   imgs: ['/img/IMG_20231018_135648.jpg', '/img/IMG_20231018_135659.jpg', '/img/IMG_20231018_135710.jpg', '/img/IMG_20231018_135718.jpg', '/img/IMG_20231018_135729.jpg', '/img/IMG_20231018_135741.jpg', '/img/IMG_20231018_135848.jpg', '/img/IMG_20231018_135855.jpg', '/img/IMG_20231018_140457.jpg']
})

const TepliKostumy2 = new Product({
   title: 'Теплі костюми',
   href: 'TepliKostumy2',
   title_long: 'Стильні теплі спортивні костюми від LION STYLE 🦁',
   breaf: 'Розмір: 46-52',
   material: 'трьохнитка футер на флісі (Туреччина)',
   description: [
      'Колір: чорний і помаранчевий',
      'Класичний спортивний стиль, зручне розташування бокових кишень та кишень на худі, великий зручний капюшон, міцна турецька тканина і товстий теплий фліс.',
      'Можна вдягати окремо або під верхній одяг.',
      'Підходить для повсякденного застосування та відпочинку.',
      'Можна носити з жовтня по квітень.',
      'Спортивні костюми від LION STYLE це тепло, комфорт і приємні відчуття!👍',
   ],
   price: 1799,
   fake_price: 2299,
   imgs: ['/img/IMG_20231021_162610.jpg', '/img/IMG_20231021_162734.jpg', '/img/IMG_20231021_162824.jpg', '/img/IMG_20231021_162934.jpg', '/img/IMG_20231021_163335.jpg', '/img/IMG_20231021_163408.jpg', '/img/IMG_20231021_163509.jpg', '/img/IMG_20231021_163639.jpg', '/img/IMG_20231021_163739.jpg', '/img/IMG_20231021_164031.jpg', '/img/IMG_20231021_164217.jpg', '/img/IMG_20231021_164233.jpg', '/img/IMG_20231022_134128_970.jpg']
})

const TepliKostumy = new Product({
   title: 'Теплі костюми',
   href: 'kostyumy',
   title_long: 'Теплі костюми з вишивкою',
   breaf: 'Нова колекція теплих спортивних костюмів від українського національного бренду LION STYLE з оригінальною вишивкою!',
   material: 'футер трьохнитка + фліс (Туреччина)',
   description: [
      'Дуже класні, стильні, комфортні та яскраві!',
      'Неповторний дизайн і найвища якість пошиву від LION STYLE!',
   ],
   price: 1999,
   fake_price: 2499,
   imgs: ['/img/14.jpg','/img/15.jpg','/img/31.jpg','/img/32.jpg','/img/33.jpg','/img/34.jpg']
})

const TeplyiKostum = new Product({
   title: 'Теплий костюм',
   href: 'TeplyiKostum',
   title_long: 'Теплий костюм з вишивкою LION STYLE (помаранчева худі з чорними рукавами+ чорні штани)',
   breaf: 'Нова колекція теплих спортивних костюмів від українського національного бренду LION STYLE з оригінальною вишивкою!',
   material: 'футер трьохнитка на флісі (Туреччина)',
   description: [
      'Худі помаранчева з чорними рукавами і фірмовою вишивкою LION STYLE. Брюки чорні',
      'Люксова якість пошиву від LION STYLE 👌⭐⭐⭐⭐⭐',
   ],
   price: 3999,
   fake_price: 4499,
   imgs: ['/img/tk01.jpg','/img/tk02.jpg','/img/tk03.jpg']
})

const ExclusiveCostyumy = new Product({
   title: 'Ексклюзивний костюм',
   href: 'exkl-kostyum',
   title_long: 'Теплий костюм від LION STYLE з ексклюзивною горизонтальною вишиванкою (помаранчевий)',
   breaf: 'Нова колекція теплих спортивних костюмів від українського національного бренду LION STYLE з оригінальною вишивкою!',
   material: 'футертрьохнитка + фліс (Туреччина)',
   description: [
      'Неповторний стиль і національна українська вишиванка!',
      'Люксова якість пошиву від LION STYLE!',
   ],
   price: 3999,
   fake_price: 4599,
   imgs: ['/img/16.jpg','/img/35.jpg','/img/36.jpg'],
})

const ExclusiveCostyum2 = new Product({
   title: 'Ексклюзивний теплий костюм',
   href: 'ExclusiveCostyum2',
   title_long: 'Теплий костюм від LION STYLE з ексклюзивною вертикальною вишиванкою (помаранчевий)',
   breaf: 'Нова колекція теплих спортивних костюмів від українського національного бренду LION STYLE з оригінальною вишивкою!',
   material: 'футер трьохнитка на флісі (Туреччина)',
   description: [
      'Худі помаранчева з оригінальною вертикальною вишивкою. Брюки чорні',
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
   ],
   price: 3999,
   fake_price: 4599,
   imgs: ['/img/extk01.jpg','/img/extk02.jpg','/img/extk03.jpg'],
})

const Futbolka = new Product({
   title: 'Футболка Стрейч Кулір',
   href: 'Futbolka',
   title_long: 'Футболка Стрейч Кулір чорна від LION STYLE 🦁',
   breaf: '',
   material: 'Елітний Стрейч Кулір найвищої якості (Туреччина) 👍',
   description: [
      'Склад: бавовна - 95%, поліестер - 5% 👌',
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
   ],
   price: 399,
   fake_price: 499,
   imgs: ['/img/f002.jpg','/img/f01.webp','/img/f02.webp','/img/f03.webp','/img/f04.webp','/img/f001.jpg','/img/f003.jpg','/img/f004.jpg'],
})

const Futbolka1 = new Product({
   title: 'Чорна Футболка',
   href: 'Futbolka1',
   title_long: 'Чорна футболка з кольоровим надписом "З Україною в серці" від LION STYLE 🦁',
   breaf: 'Розмір: 48-58',
   material: 'Стрейч Кулір найвищої якості (Туреччина) 👌',
   description: [
      'Склад: 95% бавовна, 5% поліестер 👍',
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
   ],
   price: 549,
   fake_price: 649,
   imgs: ['/img/futb1-01.jpg'],
})

const Futbolka2 = new Product({
   title: 'Чорна Футболка з логотипом',
   href: 'Futbolka2',
   title_long: 'Чорна футболка із золотим логотипом LION STYLE 🦁',
   breaf: 'Розмір: 48-58',
   material: 'Стрейч Кулір найвищої якості (Туреччина) 👌',
   description: [
      'Склад: 95% бавовна, 5% поліестер 👍',
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
   ],
   price: 499,
   fake_price: 599,
   imgs: ['/img/futb2-01.jpg'],
})

const Futbolka3 = new Product({
   title: 'Чорна Футболка з гербом',
   href: 'Futbolka3',
   title_long: 'Чорна футболка з гербом від LION STYLE 🦁',
   breaf: 'Розмір: 48-58',
   material: 'Стрейч Кулір найвищої якості (Туреччина) 👌',
   description: [
      'Склад: 95% бавовна, 5% поліестер 👍',
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
   ],
   price: 479,
   fake_price: 579,
   imgs: ['/img/futb3-01.jpg'],
})

const Futbolka4 = new Product({
   title: 'Чорна Футболка з надписом',
   href: 'Futbolka4',
   title_long: 'Чорна футболка з кольоровим надписом "I\'m Ukrainian" від LION STYLE 🦁',
   breaf: 'Розмір: 48-58',
   material: 'Стрейч Кулір найвищої якості (Туреччина) 👌',
   description: [
      'Склад: 95% бавовна, 5% поліестер 👍',
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
   ],
   price: 549,
   fake_price: 649,
   imgs: ['/img/futb4-01.jpg'],
})

const Futbolka5 = new Product({
   title: 'Чорна Футболка з серцем',
   href: 'Futbolka5',
   title_long: 'Чорна футболка з кольоровим серцем "Stay with Ukraine" від LION STYLE 🦁',
   breaf: 'Розмір: 48-58',
   material: 'Стрейч Кулір найвищої якості (Туреччина) 👌',
   description: [
      'Склад: 95% бавовна, 5% поліестер 👍',
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
   ],
   price: 599,
   fake_price: 699,
   imgs: ['/img/futb5-01.jpg'],
})

const Futbolka6 = new Product({
   title: 'Чорна Футболка з кольоровим гербом',
   href: 'Futbolka6',
   title_long: 'Чорна футболка з великим кольоровим гербом від LION STYLE 🦁',
   breaf: 'Розмір: 48-58',
   material: 'Стрейч Кулір найвищої якості (Туреччина) 👌',
   description: [
      'Склад: 95% бавовна, 5% поліестер 👍',
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
   ],
   price: 599,
   fake_price: 699,
   imgs: ['/img/futb6-01.jpg', '/img/futb6-02.jpg'],
})

const Bruki = new Product({
   title: 'Теплі чоловічі брюки',
   href: 'Bruki',
   title_long: 'Теплі чоловічі брюки від LION STYLE 🦁',
   breaf: 'Розмір: 48-58',
   material: 'софтшел на флісі (Туреччина), фірмова якісна німецька фурнітура 👍',
   description: [
      'Склад: 95% бавовна, 5% поліестер 👍',
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
      'Колір: чорний',
      'Стиль: класика+модерн',
      'Стильний неповторний дизайн з поєднанням класики і модерна. Зручні великі кишені з накладними клапанами, задній карман оздоблений фірмовою вологостійкою молнією. Спеціальне оздоблення шльовок і бокових кишень тесьмою чорного кольору. Пояс з подвійними шльовками для різного типу ременів👌',
      'Теплі, зручні, стильні та комфортні! 🤗'
   ],
   price: 1750,
   fake_price: 1999,
   imgs: ['/img/tchb01.jpg', '/img/tchb02.jpg', '/img/tchb03.jpg', '/img/tchb04.jpg', '/img/tchb05.jpg', 
    '/img/tchb06.jpg', '/img/tchb07.jpg', '/img/tchb08.jpg', '/img/bchd01.jpg', '/img/bchd02.jpg', '/img/bchd03.jpg', '/img/bchd04.jpg'],
})

// const BrukiDemi = new Product({
//    title: 'Теплі демисезонні брюки',
//    href: 'BrukiDemi',
//    title_long: 'Теплі демисезонні брюки від LION STYLE 🦁',
//    breaf: 'Розмір: 48-58',
//    material: 'софтшел на флісі (Туреччина), фірмова якісна німецька фурнітура 👍',
//    description: [
//       'Склад: 95% бавовна, 5% поліестер 👍',
//       'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
//       'Колір: чорний',
//       'Стильний неповторний дизайн з поєднанням класики і модерна! 👌',
//       'Теплі, зручні та комфортні! 🤗'
//    ],
//    price: 1850,
//    fake_price: 2050,
//    imgs: ['/img/bchd01.jpg', '/img/bchd02.jpg', '/img/bchd03.jpg', '/img/bchd04.jpg'],
// })

const CapDemi = new Product({
   title: 'Стильний демисезонний капелюх',
   href: 'CapDemi',
   title_long: 'Стильний демисезонний капелюх від LION STYLE 🦁',
   breaf: 'Розмір: 58-62',
   material: 'софтшел на флісі (Туреччина), фірмова якісна німецька фурнітура 👍',
   description: [
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
      'Колір: чорний',
   ],
   price: 450,
   fake_price: 550,
   imgs: ['/img/capd01.jpg', '/img/capd02.jpg', '/img/capd03.jpg'],
})

const FlisovaKofta = new Product({
   title: 'Тепла флісова кофта',
   href: 'FlisovaKofta',
   title_long: 'Тепла флісова кофта LION STYLE олива',
   breaf: 'Розмір: 48-58',
   material: 'флісова тканина найвищого класу (Туреччина), якісна надійна фурнітура (Німеччина)',
   description: [
      'Тепла кофта від LION STYLE вироблена з якісної флісової тканини найвищого класу (Туреччина). Тканина дуже високої щільності. Подвійна центральна вологозахисна блискавка. Бокові кишені дуже зручно розташовані та мають вологозахисні блискавки. Комір виконаний стійкою із захисним клапаном. Рукав з манжетом. Понизу кофти вставлена зручна резинка з регулюванням',
      'Трендовий стиль та неповторна модель, дуже тепла і комфортна. Чудово зігріває тіло і душу в будь-яку непогоду та холод! Підкреслює вашу унікальну особистість та вишуканий стиль!',
      'Люксова якість пошиву від LION STYLE! 👌⭐⭐⭐⭐⭐',
      'Колір: олива',
   ],
   price: 1250,
   fake_price: 1550,
   imgs: ['/img/IMG_20231111_163533.jpg', '/img/IMG_20231111_163618.jpg', '/img/IMG_20231111_163651.jpg', '/img/IMG_20231111_163707.jpg', '/img/IMG_20231111_163810.jpg', '/img/IMG_20231111_163833.jpg', '/img/IMG_20231111_163919.jpg', '/img/IMG_20231111_163958.jpg', '/img/IMG_20231111_164216.jpg', '/img/IMG_20231111_164245.jpg', '/img/IMG_20231111_164552.jpg', '/img/IMG_20231111_164658.jpg'],
})





const ChornyKostyum = new Product({
   title: 'Чорний костюм з червоними блискавками',
   href: 'ChornyKostyum',
   title_long: 'Чорний костюм з червоними блискавками від LION STYLE 🦁',
   breaf: 'Розмір: 48-58',
   material: 'флісова тканина (Туреччина), фурнітура (Німеччина)',
   description: [
      'Флісова кофта класичного спортивного стилю з водонепроникною яскравою червоною блискавкою по всій довжині. Подвійний шар флісу попереду для додаткового тепла. Бокові кишені з водонепроникними яскравими блискавками. Ворот класичною високою стійкою. Манжети на рукавах. Регулюючий шнурок зі стопорами понизу. 👌',
      'Брюки класичного спортивного стилю зі зручними боковими кишенями з яскравими червоними водонепроникними блискавками, з манжетами понизу та регулюючим пояс шнурком. 👌',
      'У нашому неповторному флісовому костюмі від LION STYLE ви будете почувати себе комфортно, зручно і впевнено у будь-якій ситуації, при будь-якій погоді та в будь-якому місці! Він ідеально підходить як для занять спортом, активного відпочинку, так і повсякденного використання! Він пасує як молодим, так і дорослим чоловікам! Костюми від LION STYLE це ваш неповторний, унікальний, вишуканий стиль, який одразу помічають всі! 👍',
   ],
   price: 1999,
   fake_price: 2550,
   imgs: ['/img/IMG_20240203_174247.jpg', '/img/IMG_20240203_174346.jpg', '/img/IMG_20240203_174433.jpg', '/img/IMG_20240203_174554.jpg', '/img/IMG_20240203_174634.jpg', '/img/IMG_20240203_174643.jpg', '/img/IMG_20240203_175036.jpg', '/img/IMG_20240203_175237.jpg', '/img/IMG_20240203_175250.jpg'],
})

const KostyumOliva = new Product({
   title: 'Костюм оліва',
   href: 'KostyumOliva',
   title_long: 'Стильний теплий флісовий костюм олива від LION STYLE 🦁',
   breaf: 'Розмір: 48-58',
   material: 'флісова тканина (Туреччина), фурнітура (Німеччина)',
   description: [
      'Флісова кофта класичного спортивного стилю з водонепроникною блискавкою по всій довжині. Бокові кишені з водонепроникними блискавками. Ворот стійкою з клапаном. Манжети на рукавах. Регулюючий шнурок зі стопорами понизу. 👌',
      'Брюки класичного спортивного стилю зі зручними боковими кишенями, з манжетами понизу та регулюючим пояс шнурком. 👌',
      'У флісовому костюмі від LION STYLE ви будете почувати себе комфортно, зручно і впевнено у будь-якій ситуації, при будь-якій погоді та в будь-якому місці! Він ідеально підходить як для занять спортом, активного відпочинку, так і повсякденного використання! Він пасує як молодим, так і дорослим чоловікам! Костюми від LION STYLE це ваш неповторний, унікальний, вишуканий стиль, який одразу помічають всі! 👍',
   ],
   price: 1799,
   fake_price: 2350,
   imgs: ['/img/IMG_20240203_172432.jpg', '/img/IMG_20240203_172601.jpg', '/img/IMG_20240203_172632.jpg', '/img/IMG_20240203_172704.jpg', '/img/IMG_20240203_172722.jpg', '/img/IMG_20240203_172827.jpg', '/img/IMG_20240203_172838.jpg', '/img/IMG_20240203_172854.jpg', '/img/IMG_20240203_172922.jpg', '/img/IMG_20240203_173054.jpg', '/img/IMG_20240203_173155.jpg', '/img/IMG_20240203_173206.jpg', '/img/IMG_20240203_173223.jpg', '/img/IMG_20240203_173224.jpg'],
})

export const ClothesCategory = new Category({
   title: 'Одяг широкого споживання',
   description: '',
   products: [
      FlisovyKostyumZeleniBlyskavky,
      ChornyKostyum,
      KostyumOliva,
      TepliKostumy1,
      Kurtka,
      Bruki,
      FlisovaKofta,
      CapDemi,
      TepliKostumy2,
      //TepliKostumy,
      //TeplyiKostum,
      ExclusiveCostyumy,
      ExclusiveCostyum2,
      Futbolka,
      Futbolka1,
      Futbolka2,
      Futbolka3,
      Futbolka4,
      Futbolka5,
      Futbolka6,
   ],
})

