const Shop1 = {
    title: 'Військторг "Мілітарі Хаб"',
    address: 'м. Київ, просп. Оболонський 47/42, ТРЦ Оазис, 4 (м. Героїв Дніпра, вихід з метро).',
    tel: ['050-240-4914'],
}

const Shop2 = {
    title: 'Військторг "База Military"',
    address: 'м. Київ, вул. Ізюмська, 1-а (м. Деміївська).',
    tel: ['067-900-6092', '066-446-7771'],
}

const Shop3 = {
    title: 'Магазин "Сумки"',
    address: 'м. Київ, вул. Олександра Довженко, 1 (м. Шулявська).',
    tel: ['093-527-9920'],
}

const Shop4 = {
    title: 'Павільйон "Сумки"',
    address: 'м. Київ, вул. Старовокзальна, 23 (ринок, м. Вокзальна).',
    tel: ['063-364-4853'],
}

const Shop5 = {
    title: 'Магазин "Військові товари"',
    address: 'м. Київ, бул.Тараса Шевченка, 58 (м. Університет).',
    tel: ['067-503-6808'],
}

const Shop6 = {
    title: 'Магазин "Хамелеон"',
    address: 'м. Київ, вул. Дегтярівська, 28а (м. Лук`янівська).',
    tel: ['095-810-7556'],
}

const Shop7 = {
    title: 'Магазин "LION STYLE"',
    address: 'м. Добропілля, вул. Івана Франка (Фрунзе), 30.',
    tel: ['050-106-6845'],
}


export const Shops = [
    Shop1,
    Shop2,
    Shop3,
    Shop4,
    Shop5,
    Shop6,
    Shop7,
]